ci4/ci4-ets-proyek-3/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'budi.gudang@mbg.id'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();