ci4/ci4-ets-proyek-3/app/Controllers/Dapur.php

    public function riwayatPermintaan()
    {
        $data = [
            'title' => 'Riwayat Permintaan Bahan',
            'permintaan' => $this->permintaanModel
                ->where('pemohon_id', session()->get('user_id'))
                ->orderBy('created_at', 'DESC')
                ->findAll()
        ];
---
SELECT *
FROM `permintaan`
WHERE `pemohon_id` = '6'
ORDER BY `created_at` DESC

    public function buatPermintaan()
    {
        $data = [
            'title' => 'Buat Permintaan Bahan Baku',

            'bahan_tersedia' => $this->bahanBakuModel
                ->where('jumlah >', 0)
                ->where('status !=', 'kadaluarsa')
                ->findAll(),
---
SELECT *
FROM `bahan_baku`
WHERE `jumlah` > 0
AND `status` != 'kadaluarsa'