ci4/ci4-ets-proyek-3/app/Controllers/Gudang.php

    public function dashboardGudang()
    {
        $data = [
            'title'                 => 'Dashboard Gudang',
            'total_bahan'           => $this->bahanBakuModel->countAllResults(),
            'segera_kadaluarsa'     => $this->bahanBakuModel->where('status', 'segera_kadaluarsa')->countAllResults(),
            'sudah_kadaluarsa'      => $this->bahanBakuModel->where('status', 'kadaluarsa')->countAllResults(),
            'stok_habis'            => $this->bahanBakuModel->where('status', 'habis')->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `bahan_baku`
WHERE `status` = 'habis'
SELECT COUNT(*) AS `numrows`
FROM `bahan_baku`

    public function lihatBahanBaku()
    {
        $data = [
            'title' => 'Data Bahan Baku',
            'semua_bahan' => $this->bahanBakuModel->findAll()
        ];
---
SELECT *
FROM `bahan_baku`

    public function createBahanBaku()
    {
        // Aturan validasi
        $rules = [
            'nama' => 'required|min_length[3]',
            'kategori' => 'required',
            'jumlah' => 'required|numeric|greater_than_equal_to[0]',
            'satuan' => 'required',
            'tanggal_masuk' => 'required|valid_date',
            'tanggal_kadaluarsa' => 'required|valid_date'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('gudang/bahan_baku/tambah')->withInput()->with('validation', $this->validator);
        }

        // Simpan data ke database
         $tanggalKadaluarsa = $this->request->getPost('tanggal_kadaluarsa');
        $jumlah = $this->request->getPost('jumlah');

        $status = 'tersedia';
        if ($jumlah <= 0) {
            $status = 'habis';
        } elseif (strtotime($tanggalKadaluarsa) < strtotime(date('Y-m-d'))) {
            $status = 'kadaluarsa';
        }

        $this->bahanBakuModel->save([
            'nama' => $this->request->getPost('nama'),
            'kategori' => $this->request->getPost('kategori'),
            'jumlah' => $jumlah,
            'satuan' => $this->request->getPost('satuan'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
            'tanggal_kadaluarsa' => $tanggalKadaluarsa,
            'status' => $status
        ]);
---
INSERT INTO `bahan_baku` (`nama`, `kategori`, `jumlah`, `satuan`, `tanggal_masuk`, `tanggal_kadaluarsa`, `status`) VALUES ('Susu Murni', 'Protein Hewani', '200', 'kg', '2025-10-02', '2025-10-03', 'kadaluarsa')

    public function editBahanBaku($id)
    {
        $data = [
            'title' => 'Edit Bahan Baku',
            'bahan' => $this->bahanBakuModel->find($id),
            'validation' => \Config\Services::validation()
        ];
---
SELECT *
FROM `bahan_baku`
WHERE `bahan_baku`.`id` = '1'

    public function updateBahanBaku($id)
    {
        $rules = [
            'nama' => 'required|min_length[3]',
            'kategori' => 'required',
            'jumlah' => 'required|numeric|greater_than_equal_to[0]',
            'satuan' => 'required',
            'tanggal_masuk' => 'required|valid_date',
            'tanggal_kadaluarsa' => 'required|valid_date'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/gudang/bahan_baku/edit/' . $id)->withInput();
        }

        $tanggalKadaluarsa = $this->request->getPost('tanggal_kadaluarsa');
        $jumlah = $this->request->getPost('jumlah');

        $status = 'tersedia';
        if ($jumlah <= 0) {
            $status = 'habis';
        } elseif (strtotime($tanggalKadaluarsa) < strtotime(date('Y-m-d'))) {
            $status = 'kadaluarsa';
        }

        $this->bahanBakuModel->save([
            'id' => $id,
            'nama' => $this->request->getPost('nama'),
            'kategori' => $this->request->getPost('kategori'),
            'jumlah' => $jumlah,
            'satuan' => $this->request->getPost('satuan'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
            'tanggal_kadaluarsa' => $tanggalKadaluarsa,
            'status' => $status
        ]);
---
UPDATE `bahan_baku` SET `nama` = 'Beras Basmati', `kategori` = 'Karbohidrat', `jumlah` = '200', `satuan` = 'kg', `tanggal_masuk` = '2025-09-01', `tanggal_kadaluarsa` = '2025-10-25', `status` = 'tersedia'
WHERE `bahan_baku`.`id` IN ('12')

    public function daftarPermintaan()
    {
        $data = [
            'title' => 'Daftar Permintaan Bahan',
            'permintaan' => $this->permintaanModel
                                ->select('permintaan.*, user.name as nama_pemohon')
                                ->join('user', 'user.id = permintaan.pemohon_id')
                                ->orderBy('permintaan.created_at', 'DESC')
                                ->findAll()
---
SELECT `permintaan`.*, `user`.`name` as `nama_pemohon`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
ORDER BY `permintaan`.`created_at` DESC

    public function detailPermintaan($id)
    {
        $data = [
            'title' => 'Detail Permintaan Bahan',
            'permintaan' => $this->permintaanModel
                                ->select('permintaan.*, user.name as nama_pemohon')
                                ->join('user', 'user.id = permintaan.pemohon_id')
                                ->find($id),
            'detail_bahan' => $this->permintaanDetailModel
                                ->select('permintaan_detail.*, bahan_baku.nama, bahan_baku.satuan, bahan_baku.jumlah as stok_saat_ini')
                                ->join('bahan_baku', 'bahan_baku.id = permintaan_detail.bahan_id')
                                ->where('permintaan_id', $id)
                                ->findAll()
---
SELECT `permintaan`.*, `user`.`name` as `nama_pemohon`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
WHERE `permintaan`.`id` = '11'
SELECT `permintaan_detail`.*, `bahan_baku`.`nama`, `bahan_baku`.`satuan`, `bahan_baku`.`jumlah` as `stok_saat_ini`
FROM `permintaan_detail`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `permintaan_detail`.`bahan_id`
WHERE `permintaan_id` = '11'