ci4/ci4-ets-proyek-3/app/Controllers/Gudang.php

    public function updateBahanBaku($id)
    {
        $rules = [
            'nama' => 'required|min_length[3]',
            'kategori' => 'required',
            'jumlah' => 'required|numeric|greater_than_equal_to[0]',
            'satuan' => 'required',
            'tanggal_masuk' => 'required|valid_date',
            'tanggal_kadaluarsa' => 'required|valid_date'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/gudang/bahan_baku/edit/' . $id)->withInput();
        }

        $this->bahanBakuModel->save([
            'id' => $id,
            'nama' => $this->request->getPost('nama'),
            'kategori' => $this->request->getPost('kategori'),
            'jumlah' => $this->request->getPost('jumlah'),
            'satuan' => $this->request->getPost('satuan'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
            'tanggal_kadaluarsa' => $this->request->getPost('tanggal_kadaluarsa'),
        ]);
---
UPDATE `bahan_baku` SET `nama` = 'Beras Medium', `kategori` = 'Karbohidrat', `jumlah` = '900', `satuan` = 'kg', `tanggal_masuk` = '2025-09-01', `tanggal_kadaluarsa` = '2026-03-01'
WHERE `bahan_baku`.`id` IN ('1')